https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html
https://www.excel-learn.com/pandas-read-excel-usecols/

In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.read_csv("HousePrices.csv")
df

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,3.130000e+05,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2.384000e+06,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02 00:00:00,3.420000e+05,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02 00:00:00,4.200000e+05,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02 00:00:00,5.500000e+05,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4595,2014-07-09 00:00:00,3.081667e+05,3.0,1.75,1510,6360,1.0,0,0,4,1510,0,1954,1979,501 N 143rd St,Seattle,WA 98133,USA
4596,2014-07-09 00:00:00,5.343333e+05,3.0,2.50,1460,7573,2.0,0,0,3,1460,0,1983,2009,14855 SE 10th Pl,Bellevue,WA 98007,USA
4597,2014-07-09 00:00:00,4.169042e+05,3.0,2.50,3010,7014,2.0,0,0,3,3010,0,2009,0,759 Ilwaco Pl NE,Renton,WA 98059,USA
4598,2014-07-10 00:00:00,2.034000e+05,4.0,2.00,2090,6630,1.0,0,0,3,1070,1020,1974,0,5148 S Creston St,Seattle,WA 98178,USA
4599,2014-07-10 00:00:00,2.206000e+05,3.0,2.50,1490,8102,2.0,0,0,4,1490,0,1990,0,18717 SE 258th St,Covington,WA 98042,USA

In [3]:
# Can try this as well
#df = pd.read_csv(r"C:\Users\ACER\PG AIML Core Applied Data Science with Python\HousePrices.csv")
#df

In [4]:
df.head(5)

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,313000.0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02 00:00:00,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02 00:00:00,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02 00:00:00,550000.0,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA

In [5]:
df.tail(5)

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
4595,2014-07-09 00:00:00,308166.666667,3.0,1.75,1510,6360,1.0,0,0,4,1510,0,1954,1979,501 N 143rd St,Seattle,WA 98133,USA
4596,2014-07-09 00:00:00,534333.333333,3.0,2.50,1460,7573,2.0,0,0,3,1460,0,1983,2009,14855 SE 10th Pl,Bellevue,WA 98007,USA
4597,2014-07-09 00:00:00,416904.166667,3.0,2.50,3010,7014,2.0,0,0,3,3010,0,2009,0,759 Ilwaco Pl NE,Renton,WA 98059,USA
4598,2014-07-10 00:00:00,203400.000000,4.0,2.00,2090,6630,1.0,0,0,3,1070,1020,1974,0,5148 S Creston St,Seattle,WA 98178,USA
4599,2014-07-10 00:00:00,220600.000000,3.0,2.50,1490,8102,2.0,0,0,4,1490,0,1990,0,18717 SE 258th St,Covington,WA 98042,USA

In [6]:
pd.__version__

'1.5.3'

In [7]:
# If there are multiple sheets in an excel we can give names to open the desired sheet
#Can select the columns directly when importing dataframes -- usecols
# Certainly there are datasets where some of the lines are empty on the top, so we can use skiprows
#df = pd.read_excel(r"C:\Users\ACER\PG AIML Core Applied Data Science with Python\Iris.xlsx", sheet_name = 0, usecols = [1,2], skiprows = 2)
df = pd.read_excel(r"C:\Users\ACER\PG AIML Core Applied Data Science with Python\Iris.xlsx", sheet_name = 0)
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [8]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [9]:
# Convert dictionary to df
dict = {"Brand":"Ford", "model":"BMW"}
dict

{'Brand': 'Ford', 'model': 'BMW'}

In [10]:
# How to create a datasource from a dictionary

data_dict = {'Name':['Yash', 'Josh', "Neelesh"],
             'Age':[25,40,40],
              'Salary':[101,24,44]}

In [11]:
data_dict

{'Name': ['Yash', 'Josh', 'Neelesh'],
 'Age': [25, 40, 40],
 'Salary': [101, 24, 44]}

In [12]:
df_dict = pd.DataFrame(data_dict)

In [13]:
df_dict

      Name  Age  Salary
0     Yash   25     101
1     Josh   40      24
2  Neelesh   40      44

In [14]:
type(data_dict)

dict

In [15]:
type(df_dict)

pandas.core.frame.DataFrame

In [16]:
# Convert list to dataframe
data_list = [['Alice',30,5000], ['bob',30,4559], ['Charlie',34,'Nan']]

In [17]:
col = ['Name','Age','Salary']

In [18]:
new_df = pd.DataFrame(data_list,columns = col)

In [19]:
new_df

      Name  Age Salary
0    Alice   30   5000
1      bob   30   4559
2  Charlie   34    Nan

In [20]:
new_df.dtypes

Name      object
Age        int64
Salary    object
dtype: object

In [21]:
# Gives access to whole dataframe
new_df[['Name','Age']]

      Name  Age
0    Alice   30
1      bob   30
2  Charlie   34

In [22]:
# 1 sq. brackets refers to a list or series whereas double [[]] --> df
new_df['Name']

0      Alice
1        bob
2    Charlie
Name: Name, dtype: object

In [23]:
type(new_df[['Name','Age']])

pandas.core.frame.DataFrame

In [24]:
type(new_df['Name'])

pandas.core.series.Series

In [25]:
# Rename the columns from Age to Total age and name to names
# Inplace is used to apply changes to the original dataframe
new_df.rename(columns = {'Age':'New_Age', 'Name':'Names'}, inplace = True)

In [26]:
new_df

     Names  New_Age Salary
0    Alice       30   5000
1      bob       30   4559
2  Charlie       34    Nan

In [27]:
# Rename the columns when importing it using names
# Change the datatypes of a columns using dtypes
#or directly mention 
#column = {'sepal_length':str, 'ABC' : int}
## Specify data types for columns using the dtype parameter column_data_types = {'Column1': int, 'Column2': str, 'Column3': float} # Read the Excel file with specified data types df = pd.read_excel(excel_file, dtype=column_data_types)
#df = pd.read_excel(r'C:\Users\ACER\PG AIML Core Applied Data Science with Python\Iris.xlsx', sheet_name=0,usecols=[0,1],names=['A','B'], dtype = {'sepal_length':str, 'ABC': int})

In [28]:
#df

In [29]:
# we want to change data type outside ppd.excel
new_df["Salary"] = new_df["Salary"].astype('float')

In [30]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [31]:
df.shape

(150, 5)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [33]:
df.size

750

In [34]:
df.ndim

2

In [35]:
df.axes

[RangeIndex(start=0, stop=150, step=1),
 Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
        'species'],
       dtype='object')]

In [36]:
# All columns
for col in df.columns:
    print(col)

sepal_length
sepal_width
petal_length
petal_width
species

In [37]:
#Dtype check
#df['Profit'].dtypes
#df.dtypes

In [38]:
# All columns and their data types in dict format
#dict(df.dtypes)

In [39]:
# All columns and their data types in list format
#df.columns.values.tolist()

In [40]:
#for only 1 columns
#df.dtypes[dtypes == 'o']

In [41]:
sorted(df)

['petal_length', 'petal_width', 'sepal_length', 'sepal_width', 'species']

In [42]:
#sorting a rows acc. to column
#sorted(df['Order ID'])

In [43]:
#Converts datatypes to best optimised data type
#df.convert_dtypes()
#df.dtypes

In [44]:
df = pd.DataFrame({'a':[1,2,3],'b':[4,5,6], "c":[123,56,6]})

In [45]:
type(df)

pandas.core.frame.DataFrame

In [46]:
min_values = df.min(axis=1)
max_values = df.max(axis=1)

In [47]:
min_values

0    1
1    2
2    3
dtype: int64

In [48]:
max_values

0    123
1     56
2      6
dtype: int64

In [49]:
std_values = df.std()

In [50]:
std_values

a     1.00000
b     1.00000
c    58.70548
dtype: float64

In [51]:
var_value = df.var()
var_value

a       1.000000
b       1.000000
c    3446.333333
dtype: float64

In [52]:
#DDOF --- DEGREE OF FREEDOM
#df["Sales"].std(ddof=0)

In [53]:
#Count of order ids
#df['ORDER ID'].count()

In [54]:

#df['category'].nunique()

In [55]:
#df['ORDER ID'].value_counts()

In [56]:
# Convert list to dataframe
data_list = [['Alice',30,5000], ['bob',30,4559], ['Charlie',34,'NaN']]

In [57]:
data_list

[['Alice', 30, 5000], ['bob', 30, 4559], ['Charlie', 34, 'NaN']]

In [58]:
col = ['Name','Age','Salary']

In [59]:
new_df = pd.DataFrame(data_list,columns = col)
new_df

      Name  Age Salary
0    Alice   30   5000
1      bob   30   4559
2  Charlie   34    NaN

In [60]:
null_values = new_df.isna()
null_values

    Name    Age  Salary
0  False  False   False
1  False  False   False
2  False  False   False

In [61]:
# Drop rows with any NaN values
filtered_df = new_df.dropna()

In [62]:
filtered_df

      Name  Age Salary
0    Alice   30   5000
1      bob   30   4559
2  Charlie   34    NaN

In [63]:
type(filtered_df)

pandas.core.frame.DataFrame

In [64]:
# For filling the null values with median
#new_df.fillna(new_df['Salary'].median(),inplace = True)